[
  {
    "slug": "CARIAGGI",
    "number": "01",
    "name": "CARIAGGI",
    "image": "/ME.jpg",
    "mobileImage": "/ME.jpg",
    "tabletImage": "/ME.jpg",
    "pcImage": "/ME.jpg",
    "url": "https://www.cariaggi.it/",
    "description": "Cariaggi is an Italian excellence in the production of high-quality yarns for knitting and weaving.\nFounded with a passion for traditional craftsmanship and a dedication to uncompromising quality, Cariaggi is globally recognized for its luxurious yarns.\nI collaborated with the design team to ensure consistency and cohesion in design and user experience across all platforms.\nThroughout my experience at Cariaggi, I have developed in-depth skills in using front-end technologies, including HTML, CSS, and JavaScript, to implement responsive and aesthetically pleasing user interfaces.\nI have worked with the Webflow platform and implemented specific sections with custom code."
  },
  {
    "slug": "pietro-ducci",
    "number": "02",
    "name": "PIETRO DUCCI",
    "image": "/DucciFoto/taskIniziale.png",
    "description": "The website of Eng. Pietro Ducci is a professional showcase presenting the services offered by Studio Tecnico Ducci in the field of engineering.\nThe portal provides a comprehensive overview of the studio's competencies and activities.\nThis portal has been designed to offer a smooth and professional user experience, reflecting the high quality of services offered by the studio.\nDuring the development process, I worked closely with the client to fully understand their needs and translate them into an intuitive and engaging interface.\nI paid particular attention to the site navigation, ensuring it was simple and straightforward, allowing users to quickly find the desired information.\nFurthermore, I implemented solutions that ensure fast page loading, helping to maintain users' attention and improve their overall experience.",
    "tabletImage": "/ME.jpg",
    "pcImage": "/ME.jpg",
    "url": "https://www.studioducci.it/",
    "Intro": {
      "src": "/DucciFoto/presentazionePc.png",

      "alt": "Presentation image for Pietro Ducci",
      "client": "Ing. Pietro Ducci",
      "role": "Front end developer",
      "type": "Personal web site"
    },
    "Skill": {
      "src": "/DucciFoto/presentazioneTablet.png",
      "src2": "/DucciFoto/presentazioneCellulare.jpg",
      "alt": "Presentation image for Pietro Ducci",
      "description": "The site was built using Next.js.\nThis technological choice ensures fast loading times and a smooth user experience.\nFor styling, Tailwind CSS was employed, allowing for the creation of a responsive and customized design with clean and efficient code.\nTailwind facilitated the creation of a modern and professional interface, perfectly aligned with the image of Studio Tecnico Ducci.\nThe entire project was developed using TypeScript, which added a layer of robustness and maintainability to the code.\nThis allowed for the detection and prevention of common errors during the development phase, resulting in a more reliable and easily maintainable application.\nThe site's architecture was designed to be modular and scalable, with reusable React components that facilitate future expansions and updates.\nParticular attention was paid to search engine optimization (SEO) and accessibility, ensuring that the site is easily discoverable online and usable by a wide range of users.",
      "skills": [
        "HTML",
        "CSS",
        "NEXT.JS",
        "REACT",
        "JavaScript",
        "TypeScript",
        "Tailwind"
      ]
    },
    "Result": {
      "src": "/DucciFoto/presentazioneResult.png",
      "alt": "Presentation image for Pietro Ducci",
      "description": "The final result is a website designed to meet the specific needs of a professional audience in the field of civil and industrial engineering.\nThe platform not only offers a comprehensive showcase of the services provided, but also serves as a strategic tool to attract and engage potential clients.\nThis portal stands out for its intuitive interface, meticulously designed to offer an exceptional user experience across all devices, from desktops to mobile devices."
    }
  }
]
